carloscn/s32k344_hse_examples/Symmetric_Algorithms/S32K344_Hse_MonotonicCounter/drivers/flash/Fls_Registers.h
/*==================================================================================================
*
*   Copyright 2022 NXP.
*
*   This software is owned or controlled by NXP and may only be used strictly in accordance with
*   the applicable license terms. By expressly accepting such terms or by downloading, installing,
*   activating and/or otherwise using the software, you are agreeing that you have read, and that
*   you agree to comply with and are bound by, such license terms. If you do not agree to
*   be bound by the applicable license terms, then you may not retain, install, activate or
*   otherwise use the software.
==================================================================================================*/
#ifndef _Fls_REGISTERS_H_
#define _Fls_REGISTERS_H_

#include "Platform_Types.h"
#include "StdRegMacros.h"

/*************************************************************************/
/*    Defining Main Registers for both FLASH and PFLASH             */
/*************************************************************************/
/* The register base addresses of Flash and PFlash  */
#define FLASH_BASEADDR                 ((uint32)0x402EC000UL)   /** @brief Flash register base address of flash  */
#define PFLASH_BASEADDR                ((uint32)0x40268000UL)   /** @brief PFlash register base address of Pflash  */

/* Memory array control/configuration registers of Flash*/
#define FLASH_MCR_ADDR32            ((uint32)(FLASH_BASEADDR + (uint32)0x00UL))  /**< @brief Module Configuration Register (MCR) */
#define FLASH_MCRS_ADDR32           ((uint32)(FLASH_BASEADDR + (uint32)0x04UL))  /**< @brief Module Configuration Status Register (MCRS)*/ 
#define FLASH_MCRE_ADDR32           ((uint32)(FLASH_BASEADDR + (uint32)0x08UL))  /**< @brief Extended Module Configuration Register (MCRE) */
#define FLASH_CTL_ADDR32            ((uint32)(FLASH_BASEADDR + (uint32)0x0CUL))  /**< @brief Module Control Register (CTL) */  
#define FLASH_ADR_ADDR32            ((uint32)(FLASH_BASEADDR + (uint32)0x10UL))  /**< @brief Address register (ADR) */
#define FLASH_PEADR_ADDR32          ((uint32)(FLASH_BASEADDR + (uint32)0x14UL))  /**< @brief Program and Erase Address register (PEADR) */
#define FLASH_SPELOCK_ADDR32        ((uint32)(FLASH_BASEADDR + (uint32)0x50UL))  /**< @brief Sector Program and Erase Hardware Lock register (SPELOCK) */
#define FLASH_SSPELOCK_ADDR32       ((uint32)(FLASH_BASEADDR + (uint32)0x54UL))  /**< @brief Super Sector Program and Erase Hardware Lock register (SSPELOCK) */
#define FLASH_XSPELOCK_ADDR32       ((uint32)(FLASH_BASEADDR + (uint32)0x70UL))  /**< @brief Express Sector Program and Erase Hardware Lock register (XSPELOCK)*/
#define FLASH_XSSPELOCK_ADDR32      ((uint32)(FLASH_BASEADDR + (uint32)0x74UL))  /**< @brief Express Super Sector Program and Erase Hardware Lock register(XSSPELOCK)*/
#define FLASH_UT0_ADDR32            ((uint32)(FLASH_BASEADDR + (uint32)0x94UL))  /**< @brief EUTest 0 register (UT0)*/
#define FLASH_UMx_ADDR32            ((uint32)(FLASH_BASEADDR + (uint32)0x98UL))  /**< @brief UMISRn register*/
#define FLASH_UM9_ADDR32            ((uint32)(FLASH_BASEADDR + (uint32)0xBCUL))  /**< @brief UMISR9 register (UM9)*/
#define FLASH_XMCR_ADDR32           ((uint32)(FLASH_BASEADDR + (uint32)0xF0UL))  /**< @brief Express Module Configuration Register (XMCR)*/
#define FLASH_XPEADR_ADDR32         ((uint32)(FLASH_BASEADDR + (uint32)0xF4UL))  /**< @brief Express Program Address register (XPEADR)*/
#define FLASH_DATAx_ADDR32          ((uint32)(FLASH_BASEADDR + (uint32)0x100UL)) /**< @brief  Program Data Register (DATA0 - DATA31)*/

/* Memory array control/configuration registers of PFlash*/
#define PFLASH_PFCPGM_PEADR_L_ADDR32            ((uint32)(PFLASH_BASEADDR + (uint32)0x300UL))  /**< @brief Platform Flash Program Erase Address Logical (PFCPGM_PEADR_L) */
#define PFLASH_PFCPGM_PEADR_P_ADDR32            ((uint32)(PFLASH_BASEADDR + (uint32)0x304UL))  /**< @brief Platform Flash Program Erase Address Physical (PFCPGM_PEADR_P) */
#define PFLASH_PFCPGM_XPEADR_L_ADDR32           ((uint32)(PFLASH_BASEADDR + (uint32)0x308UL))  /**< @brief Platform Flash Program Erase Address Logical (PFCPGM_XPEADR_L) */
#define PFLASH_PFCPGM_XPEADR_P_ADDR32           ((uint32)(PFLASH_BASEADDR + (uint32)0x30CUL))  /**< @brief Platform Flash Express Program Erase Address Physical (PFCPGM_XPEADR_P)*/
#define PFLASH_PFCBLK0_SPELOCK_ADDR32           ((uint32)(PFLASH_BASEADDR + (uint32)0x340UL)) /**< @brief  Block n Sector Program Erase Lock */
#define PFLASH_PFCBLK1_SPELOCK_ADDR32           ((uint32)(PFLASH_BASEADDR + (uint32)0x344UL)) /**< @brief  Block n Sector Program Erase Lock */
#define PFLASH_PFCBLK2_SPELOCK_ADDR32           ((uint32)(PFLASH_BASEADDR + (uint32)0x348UL)) /**< @brief  Block n Sector Program Erase Lock */
#define PFLASH_PFCBLK3_SPELOCK_ADDR32           ((uint32)(PFLASH_BASEADDR + (uint32)0x34CUL)) /**< @brief  Block n Sector Program Erase Lock */
#define PFLASH_PFCBLK4_SPELOCK_ADDR32           ((uint32)(PFLASH_BASEADDR + (uint32)0x350UL)) /**< @brief  Block n Sector Program Erase Lock */
#define PFLASH_PFCBLKU_SPELOCK_ADDR32           ((uint32)(PFLASH_BASEADDR + (uint32)0x358UL)) /**< @brief  Block UTEST Sector Program Erase Lock */
#define PFLASH_PFCBLK0_SSPELOCK_ADDR32          ((uint32)(PFLASH_BASEADDR + (uint32)0x35CUL)) /**< @brief  Block n Super Sector Program Erase Lock */
#define PFLASH_PFCBLK1_SSPELOCK_ADDR32          ((uint32)(PFLASH_BASEADDR + (uint32)0x360UL)) /**< @brief  Block n Super Sector Program Erase Lock */
#define PFLASH_PFCBLK2_SSPELOCK_ADDR32          ((uint32)(PFLASH_BASEADDR + (uint32)0x364UL)) /**< @brief  Block n Super Sector Program Erase Lock */
#define PFLASH_PFCBLK3_SSPELOCK_ADDR32          ((uint32)(PFLASH_BASEADDR + (uint32)0x368UL)) /**< @brief  Block n Super Sector Program Erase Lock */
#define PFLASH_PFCBLK4_SSPELOCK_ADDR32          ((uint32)(PFLASH_BASEADDR + (uint32)0x36CUL)) /**< @brief  Block n Super Sector Program Erase Lock */
#define PFLASH_PFCBLK0_SETSLOCK_ADDR32          ((uint32)(PFLASH_BASEADDR + (uint32)0x380UL)) /**< @brief  Block n Set Sector Lock */
#define PFLASH_PFCBLK1_SETSLOCK_ADDR32          ((uint32)(PFLASH_BASEADDR + (uint32)0x384UL)) /**< @brief  Block n Set Sector Lock */
#define PFLASH_PFCBLK2_SETSLOCK_ADDR32          ((uint32)(PFLASH_BASEADDR + (uint32)0x388UL)) /**< @brief  Block n Set Sector Lock */
#define PFLASH_PFCBLK3_SETSLOCK_ADDR32          ((uint32)(PFLASH_BASEADDR + (uint32)0x38CUL)) /**< @brief  Block n Set Sector Lock */
#define PFLASH_PFCBLK4_SETSLOCK_ADDR32          ((uint32)(PFLASH_BASEADDR + (uint32)0x390UL)) /**< @brief  Block n Set Sector Lock */
#define PFLASH_PFCBLKU_SETSLOCK_ADDR32          ((uint32)(PFLASH_BASEADDR + (uint32)0x398UL)) /**< @brief  Block UTEST Set Sector Lock */
#define PFLASH_PFCBLK0_SSETSLOCK_ADDR32         ((uint32)(PFLASH_BASEADDR + (uint32)0x39CUL)) /**< @brief  Block n Set Super Sector Lock */
#define PFLASH_PFCBLK1_SSETSLOCK_ADDR32         ((uint32)(PFLASH_BASEADDR + (uint32)0x3A0UL)) /**< @brief  Block n Set Super Sector Lock */
#define PFLASH_PFCBLK2_SSETSLOCK_ADDR32         ((uint32)(PFLASH_BASEADDR + (uint32)0x3A4UL)) /**< @brief  Block n Set Super Sector Lock */
#define PFLASH_PFCBLK3_SSETSLOCK_ADDR32         ((uint32)(PFLASH_BASEADDR + (uint32)0x3A8UL)) /**< @brief  Block n Set Super Sector Lock */
#define PFLASH_PFCBLK4_SSETSLOCK_ADDR32         ((uint32)(PFLASH_BASEADDR + (uint32)0x3ACUL)) /**< @brief  Block n Set Super Sector Lock */
#define PFLASH_PFCBLK0_LOCKMASTER_S0_ADDR32     ((uint32)(PFLASH_BASEADDR + (uint32)0x3C0UL)) /**< @brief  Block a Lock Master Sectorb  */
#define PFLASH_PFCBLK1_LOCKMASTER_S0_ADDR32     ((uint32)(PFLASH_BASEADDR + (uint32)0x3E0UL)) /**< @brief  Block a Lock Master Sectorb  */
#define PFLASH_PFCBLK2_LOCKMASTER_S0_ADDR32     ((uint32)(PFLASH_BASEADDR + (uint32)0x400UL)) /**< @brief  Block a Lock Master Sectorb  */
#define PFLASH_PFCBLK3_LOCKMASTER_S0_ADDR32     ((uint32)(PFLASH_BASEADDR + (uint32)0x420UL)) /**< @brief  Block a Lock Master Sectorb  */
#define PFLASH_PFCBLK4_LOCKMASTER_S0_ADDR32     ((uint32)(PFLASH_BASEADDR + (uint32)0x440UL)) /**< @brief  Block a Lock Master Sectorb  */
#define PFLASH_PFCBLKU_LOCKMASTER_S_ADDR32      ((uint32)(PFLASH_BASEADDR + (uint32)0x480UL)) /**< @brief  Block UTEST Lock Master Sector  */
#define PFLASH_PFCBLK0_LOCKMASTER_SS0_ADDR32    ((uint32)(PFLASH_BASEADDR + (uint32)0x484UL)) /**< @brief  Block a Lock Master Super Sectorb   */
#define PFLASH_PFCBLK4_LOCKMASTER_SS0_ADDR32    ((uint32)(PFLASH_BASEADDR + (uint32)0x4C4UL)) /**< @brief  Block a Lock Master Super Sectorb  */
/******************************************************Main registers *******************************************************/
/* MCR register bits */
#define FLASH_MCR_PEID_U32            ((uint32)0x00FF0000UL)  /**< @brief PEID[16-23]:Program and Erase Master/Domain ID (Only Read)*/
#define FLASH_MCR_PEID_SHIFT_U32      (16U)                   /**< @brief PEID[16-23]:Program and Erase Master/Domain ID (Only Read)*/
#define FLASH_MCR_PECIE_U32           ((uint32)0x00008000UL)  /**< @brief PECIE[15]:  Program/Erase Complete Interrupt Enable */
#define FLASH_MCR_WDIE_U32            ((uint32)0x00001000UL)  /**< @brief WDIE[12]:   Watch Dog Interrupt Enable */
#define FLASH_MCR_PGM_U32             ((uint32)0x00000100UL)  /**< @brief PGM[8]:     Program (Read/Write) */
#define FLASH_MCR_ESS_U32             ((uint32)0x00000020UL)  /**< @brief ESS[5]:     Erase Size Select (Read/Write) */
#define FLASH_MCR_ERS_U32             ((uint32)0x00000010UL)  /**< @brief ERS[4]:     Erase (Read/Write) */
#define FLASH_MCR_EHV_U32             ((uint32)0x00000001UL)  /**< @brief EHV[0]:     Enable High Voltage (Read/Write)*/

