carloscn/s32k344_hse_examples/Symmetric_Algorithms/S32K344_Hse_MonotonicCounter/drivers/flash/Fls_Registers.h
/* MCRS register bits */
#define FLASH_MCRS_EER_W1C       ((uint32)0x80000000UL)  /**< @brief EER[31]: ECC Event Error (W1C) */
#define FLASH_MCRS_SBC_W1C       ((uint32)0x40000000UL)  /**< @brief SBC[30]: Single Bit Correction (W1C) */
#define FLASH_MCRS_AEE_W1C       ((uint32)0x20000000UL)  /**< @brief AEE[29]: Address Encode Error (W1C) */
#define FLASH_MCRS_EEE_W1C       ((uint32)0x10000000UL)  /**< @brief EEE[28]: EDC after ECC Error (W1C) */
#define FLASH_MCRS_RVE_W1C       ((uint32)0x02000000UL)  /**< @brief RVE[25]: Read Voltage Error (W1C) */
#define FLASH_MCRS_RRE_W1C       ((uint32)0x01000000UL)  /**< @brief RVE[24]: Read Reference Error(W1C) */
#define FLASH_MCRS_RWE_W1C       ((uint32)0x00100000UL)  /**< @brief RWE[20]: Read-While-Write Event Error(W1C) */
#define FLASH_MCRS_PEP_W1C       ((uint32)0x00020000UL)  /**< @brief PEP[17]: Program and Erase Protection Error(W1C) */
#define FLASH_MCRS_PES_W1C       ((uint32)0x00010000UL)  /**< @brief PES[16]: Program and Erase Sequence Error(W1C) */
#define FLASH_MCRS_DONE_U32      ((uint32)0x00008000UL)  /**< @brief DONE[15]:State Machine Status(Only Read) */
#define FLASH_MCRS_PEG_U32       ((uint32)0x00004000UL)  /**< @brief PEG[14]: Program/Erase Good(Only Read) */
#define FLASH_MCRS_TSPELOCK_U32  ((uint32)0x00000100UL)  /**< @brief PEG[8]:  UTest NVM Program and Erase Lock(Only Read) */
#define FLASH_MCRS_RE_U32        ((uint32)0x00000001UL)  /**< @brief RE[0]:   Reset Error(Only Read) */
/* Block n Sector Program Erase Lock PFCBLK0_SPELOCK - PFCBLK4_SPELOCK register bits */
#define PFLASH_PFCBLKx_SPELOCK_SLCK31_U32     ((uint32)0x80000000UL)  /**< @brief SLCK[0-31] Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SPELOCK_SLCK30_U32     ((uint32)0x40000000UL)  /**< @brief SLCK[0-31] Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SPELOCK_SLCK29_U32     ((uint32)0x20000000UL)  /**< @brief SLCK[0-31] Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SPELOCK_SLCK28_U32     ((uint32)0x10000000UL)  /**< @brief SLCK[0-31] Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SPELOCK_SLCK27_U32     ((uint32)0x08000000UL)  /**< @brief SLCK[0-31] Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SPELOCK_SLCK26_U32     ((uint32)0x04000000UL)  /**< @brief SLCK[0-31] Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SPELOCK_SLCK25_U32     ((uint32)0x02000000UL)  /**< @brief SLCK[0-31] Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SPELOCK_SLCK24_U32     ((uint32)0x01000000UL)  /**< @brief SLCK[0-31] Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SPELOCK_SLCK23_U32     ((uint32)0x00800000UL)  /**< @brief SLCK[0-31] Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SPELOCK_SLCK22_U32     ((uint32)0x00400000UL)  /**< @brief SLCK[0-31] Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SPELOCK_SLCK21_U32     ((uint32)0x00200000UL)  /**< @brief SLCK[0-31] Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SPELOCK_SLCK20_U32     ((uint32)0x00100000UL)  /**< @brief SLCK[0-31] Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SPELOCK_SLCK19_U32     ((uint32)0x00080000UL)  /**< @brief SLCK[0-31] Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SPELOCK_SLCK18_U32     ((uint32)0x00040000UL)  /**< @brief SLCK[0-31] Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SPELOCK_SLCK17_U32     ((uint32)0x00020000UL)  /**< @brief SLCK[0-31] Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SPELOCK_SLCK16_U32     ((uint32)0x00010000UL)  /**< @brief SLCK[0-31] Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SPELOCK_SLCK15_U32     ((uint32)0x00008000UL)  /**< @brief SLCK[0-31] Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SPELOCK_SLCK14_U32     ((uint32)0x00004000UL)  /**< @brief SLCK[0-31] Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SPELOCK_SLCK13_U32     ((uint32)0x00002000UL)  /**< @brief SLCK[0-31] Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SPELOCK_SLCK12_U32     ((uint32)0x00001000UL)  /**< @brief SLCK[0-31] Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SPELOCK_SLCK11_U32     ((uint32)0x00000800UL)  /**< @brief SLCK[0-31] Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SPELOCK_SLCK10_U32     ((uint32)0x00000400UL)  /**< @brief SLCK[0-31] Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SPELOCK_SLCK9_U32      ((uint32)0x00000200UL)  /**< @brief SLCK[0-31] Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SPELOCK_SLCK8_U32      ((uint32)0x00000100UL)  /**< @brief SLCK[0-31] Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SPELOCK_SLCK7_U32      ((uint32)0x00000080UL)  /**< @brief SLCK[0-31] Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SPELOCK_SLCK6_U32      ((uint32)0x00000040UL)  /**< @brief SLCK[0-31] Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SPELOCK_SLCK5_U32      ((uint32)0x00000020UL)  /**< @brief SLCK[0-31] Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SPELOCK_SLCK4_U32      ((uint32)0x00000010UL)  /**< @brief SLCK[0-31] Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SPELOCK_SLCK3_U32      ((uint32)0x00000008UL)  /**< @brief SLCK[0-31] Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SPELOCK_SLCK2_U32      ((uint32)0x00000004UL)  /**< @brief SLCK[0-31] Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SPELOCK_SLCK1_U32      ((uint32)0x00000002UL)  /**< @brief SLCK[0-31] Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SPELOCK_SLCK0_U32      ((uint32)0x00000001UL)  /**< @brief SLCK[0-31] Sector is available for program and erase operation 31-0 (Read/Write) */
/* PFCBLKU_SPELOCK register bits */ 
#define PFLASH_PFCBLKU_SPELOCK_SLCK00_U32     ((uint32)0x00000001UL)  /**< @brief SLCK[0] Sector is available for program and erase operation 0(Read/Write) */
/*Block n Super Sector Program Erase Lock (PFCBLK0_SSPELOCK - PFCBLK4_SSPELOCK)*/
#define PFLASH_PFCBLKx_SSPELOCK_SSLCK31_U32     ((uint32)0x80000000UL)  /**< @brief SSLCK[0-31] Super Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSPELOCK_SSLCK30_U32     ((uint32)0x40000000UL)  /**< @brief SSLCK[0-31] Super Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSPELOCK_SSLCK29_U32     ((uint32)0x20000000UL)  /**< @brief SSLCK[0-31] Super Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSPELOCK_SSLCK28_U32     ((uint32)0x10000000UL)  /**< @brief SSLCK[0-31] Super Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSPELOCK_SSLCK27_U32     ((uint32)0x08000000UL)  /**< @brief SSLCK[0-31] Super Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSPELOCK_SSLCK26_U32     ((uint32)0x04000000UL)  /**< @brief SSLCK[0-31] Super Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSPELOCK_SSLCK25_U32     ((uint32)0x02000000UL)  /**< @brief SSLCK[0-31] Super Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSPELOCK_SSLCK24_U32     ((uint32)0x01000000UL)  /**< @brief SSLCK[0-31] Super Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSPELOCK_SSLCK23_U32     ((uint32)0x00800000UL)  /**< @brief SSLCK[0-31] Super Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSPELOCK_SSLCK22_U32     ((uint32)0x00400000UL)  /**< @brief SSLCK[0-31] Super Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSPELOCK_SSLCK21_U32     ((uint32)0x00200000UL)  /**< @brief SSLCK[0-31] Super Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSPELOCK_SSLCK20_U32     ((uint32)0x00100000UL)  /**< @brief SSLCK[0-31] Super Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSPELOCK_SSLCK19_U32     ((uint32)0x00080000UL)  /**< @brief SSLCK[0-31] Super Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSPELOCK_SSLCK18_U32     ((uint32)0x00040000UL)  /**< @brief SSLCK[0-31] Super Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSPELOCK_SSLCK17_U32     ((uint32)0x00020000UL)  /**< @brief SSLCK[0-31] Super Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSPELOCK_SSLCK16_U32     ((uint32)0x00010000UL)  /**< @brief SSLCK[0-31] Super Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSPELOCK_SSLCK15_U32     ((uint32)0x00008000UL)  /**< @brief SSLCK[0-31] Super Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSPELOCK_SSLCK14_U32     ((uint32)0x00004000UL)  /**< @brief SSLCK[0-31] Super Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSPELOCK_SSLCK13_U32     ((uint32)0x00002000UL)  /**< @brief SSLCK[0-31] Super Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSPELOCK_SSLCK12_U32     ((uint32)0x00001000UL)  /**< @brief SSLCK[0-31] Super Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSPELOCK_SSLCK11_U32     ((uint32)0x00000800UL)  /**< @brief SSLCK[0-31] Super Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSPELOCK_SSLCK10_U32     ((uint32)0x00000400UL)  /**< @brief SSLCK[0-31] Super Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSPELOCK_SSLCK9_U32      ((uint32)0x00000200UL)  /**< @brief SSLCK[0-31] Super Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSPELOCK_SSLCK8_U32      ((uint32)0x00000100UL)  /**< @brief SSLCK[0-31] Super Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSPELOCK_SSLCK7_U32      ((uint32)0x00000080UL)  /**< @brief SSLCK[0-31] Super Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSPELOCK_SSLCK6_U32      ((uint32)0x00000040UL)  /**< @brief SSLCK[0-31] Super Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSPELOCK_SSLCK5_U32      ((uint32)0x00000020UL)  /**< @brief SSLCK[0-31] Super Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSPELOCK_SSLCK4_U32      ((uint32)0x00000010UL)  /**< @brief SSLCK[0-31] Super Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSPELOCK_SSLCK3_U32      ((uint32)0x00000008UL)  /**< @brief SSLCK[0-31] Super Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSPELOCK_SSLCK2_U32      ((uint32)0x00000004UL)  /**< @brief SSLCK[0-31] Super Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSPELOCK_SSLCK1_U32      ((uint32)0x00000002UL)  /**< @brief SSLCK[0-31] Super Sector is available for program and erase operation 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSPELOCK_SSLCK0_U32      ((uint32)0x00000001UL)  /**< @brief SSLCK[0-31] Super Sector is available for program and erase operation 31-0 (Read/Write) */
/* Block n Set Sector Lock (PFCBLK0_SETSLOCK - PFCBLK4_SETSLOCK) */
#define PFLASH_PFCBLKx_SETSLOCK_SETSLCK31_U32     ((uint32)0x80000000UL)  /**< @brief SLCK[0-31]  Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SETSLOCK_SETSLCK30_U32     ((uint32)0x40000000UL)  /**< @brief SLCK[0-31]  Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SETSLOCK_SETSLCK29_U32     ((uint32)0x20000000UL)  /**< @brief SLCK[0-31]  Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SETSLOCK_SETSLCK28_U32     ((uint32)0x10000000UL)  /**< @brief SLCK[0-31]  Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SETSLOCK_SETSLCK27_U32     ((uint32)0x08000000UL)  /**< @brief SLCK[0-31]  Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SETSLOCK_SETSLCK26_U32     ((uint32)0x04000000UL)  /**< @brief SLCK[0-31]  Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SETSLOCK_SETSLCK25_U32     ((uint32)0x02000000UL)  /**< @brief SLCK[0-31]  Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SETSLOCK_SETSLCK24_U32     ((uint32)0x01000000UL)  /**< @brief SLCK[0-31]  Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SETSLOCK_SETSLCK23_U32     ((uint32)0x00800000UL)  /**< @brief SLCK[0-31]  Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SETSLOCK_SETSLCK22_U32     ((uint32)0x00400000UL)  /**< @brief SLCK[0-31]  Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SETSLOCK_SETSLCK21_U32     ((uint32)0x00200000UL)  /**< @brief SLCK[0-31]  Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SETSLOCK_SETSLCK20_U32     ((uint32)0x00100000UL)  /**< @brief SLCK[0-31]  Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SETSLOCK_SETSLCK19_U32     ((uint32)0x00080000UL)  /**< @brief SLCK[0-31]  Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SETSLOCK_SETSLCK18_U32     ((uint32)0x00040000UL)  /**< @brief SLCK[0-31]  Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SETSLOCK_SETSLCK17_U32     ((uint32)0x00020000UL)  /**< @brief SLCK[0-31]  Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SETSLOCK_SETSLCK16_U32     ((uint32)0x00010000UL)  /**< @brief SLCK[0-31]  Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SETSLOCK_SETSLCK15_U32     ((uint32)0x00008000UL)  /**< @brief SLCK[0-31]  Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SETSLOCK_SETSLCK14_U32     ((uint32)0x00004000UL)  /**< @brief SLCK[0-31]  Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SETSLOCK_SETSLCK13_U32     ((uint32)0x00002000UL)  /**< @brief SLCK[0-31]  Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SETSLOCK_SETSLCK12_U32     ((uint32)0x00001000UL)  /**< @brief SLCK[0-31]  Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SETSLOCK_SETSLCK11_U32     ((uint32)0x00000800UL)  /**< @brief SLCK[0-31]  Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SETSLOCK_SETSLCK10_U32     ((uint32)0x00000400UL)  /**< @brief SLCK[0-31]  Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SETSLOCK_SETSLCK9_U32      ((uint32)0x00000200UL)  /**< @brief SLCK[0-31]  Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SETSLOCK_SETSLCK8_U32      ((uint32)0x00000100UL)  /**< @brief SLCK[0-31]  Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SETSLOCK_SETSLCK7_U32      ((uint32)0x00000080UL)  /**< @brief SLCK[0-31]  Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SETSLOCK_SETSLCK6_U32      ((uint32)0x00000040UL)  /**< @brief SLCK[0-31]  Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SETSLOCK_SETSLCK5_U32      ((uint32)0x00000020UL)  /**< @brief SLCK[0-31]  Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SETSLOCK_SETSLCK4_U32      ((uint32)0x00000010UL)  /**< @brief SLCK[0-31]  Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SETSLOCK_SETSLCK3_U32      ((uint32)0x00000008UL)  /**< @brief SLCK[0-31]  Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SETSLOCK_SETSLCK2_U32      ((uint32)0x00000004UL)  /**< @brief SLCK[0-31]  Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SETSLOCK_SETSLCK1_U32      ((uint32)0x00000002UL)  /**< @brief SLCK[0-31]  Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SETSLOCK_SETSLCK0_U32      ((uint32)0x00000001UL)  /**< @brief SLCK[0-31]  Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
/* Block UTEST Set Sector Lock (PFCBLKU_SETSLOCK) */ 
#define PFLASH_PFCBLKU_SETSLOCK_SETSLCK00_U32     ((uint32)0x00000001UL)  /**< @brief SLCK[0] Corresponding lock bit is owned by any master 0(Read/Write) */
/*Block n Set Super Sector Lock (PFCBLK0_SSETSLOCK - PFCBLK4_SSETSLOCK)*/
#define PFLASH_PFCBLKx_SSETSLOCK_SSETSLCK31_U32     ((uint32)0x80000000UL)  /**< @brief SSLCK[0-31] Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSETSLOCK_SSETSLCK30_U32     ((uint32)0x40000000UL)  /**< @brief SSLCK[0-31] Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSETSLOCK_SSETSLCK29_U32     ((uint32)0x20000000UL)  /**< @brief SSLCK[0-31] Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSETSLOCK_SSETSLCK28_U32     ((uint32)0x10000000UL)  /**< @brief SSLCK[0-31] Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSETSLOCK_SSETSLCK27_U32     ((uint32)0x08000000UL)  /**< @brief SSLCK[0-31] Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSETSLOCK_SSETSLCK26_U32     ((uint32)0x04000000UL)  /**< @brief SSLCK[0-31] Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSETSLOCK_SSETSLCK25_U32     ((uint32)0x02000000UL)  /**< @brief SSLCK[0-31] Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSETSLOCK_SSETSLCK24_U32     ((uint32)0x01000000UL)  /**< @brief SSLCK[0-31] Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSETSLOCK_SSETSLCK23_U32     ((uint32)0x00800000UL)  /**< @brief SSLCK[0-31] Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSETSLOCK_SSETSLCK22_U32     ((uint32)0x00400000UL)  /**< @brief SSLCK[0-31] Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSETSLOCK_SSETSLCK21_U32     ((uint32)0x00200000UL)  /**< @brief SSLCK[0-31] Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSETSLOCK_SSETSLCK20_U32     ((uint32)0x00100000UL)  /**< @brief SSLCK[0-31] Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSETSLOCK_SSETSLCK19_U32     ((uint32)0x00080000UL)  /**< @brief SSLCK[0-31] Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSETSLOCK_SSETSLCK18_U32     ((uint32)0x00040000UL)  /**< @brief SSLCK[0-31] Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSETSLOCK_SSETSLCK17_U32     ((uint32)0x00020000UL)  /**< @brief SSLCK[0-31] Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSETSLOCK_SSETSLCK16_U32     ((uint32)0x00010000UL)  /**< @brief SSLCK[0-31] Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSETSLOCK_SSETSLCK15_U32     ((uint32)0x00008000UL)  /**< @brief SSLCK[0-31] Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSETSLOCK_SSETSLCK14_U32     ((uint32)0x00004000UL)  /**< @brief SSLCK[0-31] Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSETSLOCK_SSETSLCK13_U32     ((uint32)0x00002000UL)  /**< @brief SSLCK[0-31] Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSETSLOCK_SSETSLCK12_U32     ((uint32)0x00001000UL)  /**< @brief SSLCK[0-31] Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSETSLOCK_SSETSLCK11_U32     ((uint32)0x00000800UL)  /**< @brief SSLCK[0-31] Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSETSLOCK_SSETSLCK10_U32     ((uint32)0x00000400UL)  /**< @brief SSLCK[0-31] Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSETSLOCK_SSETSLCK9_U32      ((uint32)0x00000200UL)  /**< @brief SSLCK[0-31] Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSETSLOCK_SSETSLCK8_U32      ((uint32)0x00000100UL)  /**< @brief SSLCK[0-31] Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSETSLOCK_SSETSLCK7_U32      ((uint32)0x00000080UL)  /**< @brief SSLCK[0-31] Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSETSLOCK_SSETSLCK6_U32      ((uint32)0x00000040UL)  /**< @brief SSLCK[0-31] Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSETSLOCK_SSETSLCK5_U32      ((uint32)0x00000020UL)  /**< @brief SSLCK[0-31] Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSETSLOCK_SSETSLCK4_U32      ((uint32)0x00000010UL)  /**< @brief SSLCK[0-31] Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSETSLOCK_SSETSLCK3_U32      ((uint32)0x00000008UL)  /**< @brief SSLCK[0-31] Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSETSLOCK_SSETSLCK2_U32      ((uint32)0x00000004UL)  /**< @brief SSLCK[0-31] Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSETSLOCK_SSETSLCK1_U32      ((uint32)0x00000002UL)  /**< @brief SSLCK[0-31] Corresponding lock bit is owned by any master. 31-0 (Read/Write) */
#define PFLASH_PFCBLKx_SSETSLOCK_SSETSLCK0_U32      ((uint32)0x00000001UL)  /**< @brief SSLCK[0-31] Corresponding lock bit is owned by any master. 31-0 (Read/Write) */

