carloscn/s32k344_hse_examples/Symmetric_Algorithms/S32K344_Hse_MonotonicCounter/drivers/flash/Fls_Registers.h
/* UT0 register bits */
#define FLASH_UT0_UTE_U32          ((uint32)0x80000000UL)  /**< @brief UTE[31]: U-Test Enable (Read/Write) */
#define FLASH_UT0_SBCE_U32         ((uint32)0x40000000UL)  /**< @brief SBCE[30]: Single Bit Corrections observation (Read/Write) */
#define FLASH_UT0_NAIBP_U32        ((uint32)0x00000200UL)  /**< @brief NAIBP[9]: S Array Integrity state machine (Read/Write) */
#define FLASH_UT0_AIBPE_U32        ((uint32)0x00000100UL)  /**< @brief AIBPE[8]: Array Integrity breakpoints (Read/Write) */
#define FLASH_UT0_AIS_U32          ((uint32)0x00000004UL)  /**< @brief AIS[2]: Array integrity sequence is proprietary/sequential sequence. (Read/Write) */
#define FLASH_UT0_AIE_U32          ((uint32)0x00000002UL)  /**< @brief AIE[1]: Array Integrity Enable */
#define FLASH_UT0_AID_U32          ((uint32)0x00000001UL)  /**< @brief AID[0]: Array Integrity Done */

/* Express program XMCR*/
#define FLASH_XMCR_XPEID_U32      ((uint32)0x00FF0000UL)  /**< @brief APEID[16-23]: Express Program Master/Domain ID*/
#define FLASH_MCR_XPEID_SHIFT_U32 (16U)  /**< @brief APEID[16-23]: Express Program Master/Domain ID*/
#define FLASH_XMCR_XDONE_U32      ((uint32)0x00008000UL)  /**< @brief XDONE[15]: Express State Machine Status*/
#define FLASH_XMCR_XPEG_U32       ((uint32)0x00004000UL)  /**< @brief APEID[14]: Express Program Good*/
#define FLASH_XMCR_XDOK_U32       ((uint32)0x00002000UL)  /**< @brief XPEG[13]: Express Data OK*/
#define FLASH_XMCR_XWDI_U32       ((uint32)0x00001000UL)  /**< @brief XWDI[12]: Express Watch Dog Interrupt*/
#define FLASH_XMCR_XWDIE_U32      ((uint32)0x00000800UL)  /**< @brief XWDIE[11]: Express Watch Dog Interrupt Enable*/
#define FLASH_XMCR_XPGM_U32       ((uint32)0x00000100UL)  /**< @brief APGM[8]: Express Program */
#define FLASH_XMCR_XEHV_U32       ((uint32)0x00000001UL)  /**< @brief AEHV[0]: Express Enable High Voltage*/


#endif /* _Fls_REGISTERS_H_ */
